Autodesk.Revit.DB.DirectContext3D.IndexStreamLine.AddLines(System.Collections.Generic.IList{Autodesk.Revit.DB.DirectContext3D.IndexLine})
Inserts multiple line segments into the stream and associated buffer.
lines:
The line segments to be inserted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the associated buffer is not mapped.
-or-
Thrown if the associated buffer has insufficient space.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.IndexStreamLine.AddLine(Autodesk.Revit.DB.DirectContext3D.IndexLine)
Inserts a line segment into the stream and associated buffer.
line:
The line segment to be inserted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the associated buffer is not mapped.
-or-
Thrown if the associated buffer has insufficient space.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.IndexStreamLine
A stream that can be used to write line segment primitives into a buffer (see Autodesk::Revit::DB::DirectContext3D::IndexBuffer).
Since:
2017